Gets the custom data type from its identifier. See FabricationCustomDataType enumerator.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public FabricationCustomDataType GetPartCustomDataType(
	int statusId
)
  Visual Basic
Public Function GetPartCustomDataType ( _
	statusId As Integer _
) As FabricationCustomDataType
  Visual C++
public:
FabricationCustomDataType GetPartCustomDataType(
	int statusId
)
 Parameters
  statusId
 Type:  System Int32
 The custom data identifier.
 Return Value
 The custom data type.
 See Also
  FabricationConfiguration Class
  Autodesk.Revit.DB Namespace